newwms_gift/src/Documents/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка</name>
  <registerRecords>InformationRegister.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка</registerRecords>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйАссортиметныйУчасток</name>
    <type>
      <types>CatalogRef.ит_WMS_АссортиментныеУчасткиСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка/ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АссортиментныйУчастокСклада</name>
    <type>
      <types>CatalogRef.ит_WMS_АссортиментныеУчасткиСклада</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Проведен и РежимЗаписи=РежимЗаписиДокумента.Запись Тогда 
		Если ОбменДанными.Загрузка Тогда 
			РежимЗаписи=РежимЗаписиДокумента.Проведение;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
		ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда 
		Отказ=Ложь;
	КонецЕсли;	

КонецПроцедуры

Процедура ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения)
	Если Организация.Пустая() Тогда 
		Сообщить("Заполните организацию");
		Отказ=Истина;
	КонецЕсли;
	Если НовыйАссортиметныйУчасток.Пустая() Тогда 
		Сообщить("Заполните Ассортиментный участок");
		Отказ=Истина;
	КонецЕсли;
	Если Отказ Тогда 
		Возврат
	КонецЕсли;	
	СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен;
КонецПроцедуры

Процедура ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Записывать=Истина;
	Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Очистить();
	Для Каждого стр из СписокНоменклатуры цикл
		НоваяЗапись=Движения.ит_WMS_СоответсвияНоменклатурыИАссортиментногоУчастка.Добавить();
		НоваяЗапись.Организация=Организация;
		НоваяЗапись.Номенклатура=стр.Номенклатура;
		НоваяЗапись.Период=Дата;
		НоваяЗапись.АссортиментныйУчастокСклада=НовыйАссортиметныйУчасток;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры
